Documentation (#6)
* Implement One‑shot connection health check toy app

* Import Serializer into Beacon

* Made Sentinel use Serializer class

* Error handling when shutting down workers

* Add replicas to sentinel

* Add bully selection leader

* Add shutdown logic

* Make logs more clear

* Add script for easily killing sentinels

* Remove version from docker compose

* Add: restart funcitonallity for Sentinel's workers

* Make Sentinel capable of checking multiple workers

* Add: SentinelBeacon and sentinel container

* Add: SentinelBeacon instansiation for filter by year worker working fine with correct health cheack and restart mechanism with the corresponding sentinel

* Update: using Serializer class methods in the sentinel worker

* Update: sentinel filename to Sentinel

* Update: sentinel filename to Sentinel

* Add: reviving ex-leader mechanism

* Make leader detect and restart fallen slaves

* Update leader dead duration constant

* Add readme explaining sentinel implementation

* Add: sentinels in filter by year worker and router worker. Also added in the script but only for the join_credits_router and filter_by_year worker

* Fix Docker ports in generate scrip

* Fix script for better name matching

* First approach of persistence

* Change volume to bind mount for logs

* Update: WAL seems to work with minimal implementation and testing by killing it in various different sections of the code (worker and WAL class). WIP but not that WIP though

* Update: WAL uses a IParser interface implementation for returning data to worker

* Update: using parser in WAL

* Add: sending operation_id in data. Operation_id is created in the boundary and in each statefull node, it creates a new one as well since this nodes send new processed data

* Add: volume for each worker

* Add: volume for each router
